No element in a secondary Option can be referenced by an element outside that Option.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId BadReferenceToSecondary { get; }
  Visual Basic
Public Shared ReadOnly Property BadReferenceToSecondary As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ BadReferenceToSecondary {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures DesignOptionFailures Class
  Autodesk.Revit.DB Namespace